<HTML><HEAD><META NAME="GENERATOR" CONTENT="EMACS - what else?!"><META NAME="AUTHOR" CONTENT="Heiko Holtkamp"><META HTTP-EQUIV="Content Type" CONTENT="text/html;CHARSET=iso-8859-1"><META HTTP-EQUIV="DESCRIPTION" CONTENT="Einfuehrung in TCP/IP,
                 Introduction to TCP/IP"><TITLE>Einf&uuml;hrung in TCP/IP - Einf&uuml;hrung: Referenzmodelle</TITLE> </HEAD><BODY BGCOLOR="#FFFFFF" TEXT="#000000" LINK="#000080" ALINK="#FF0000" VLINK="#404040"><CENTER><TABLE BORDER="0" CELLSPACING="0" CELLPADDING="0" WIDTH="95%"><TR><TD>&nbsp;</TD></TR><TR VALIGN="MIDDLE"><TD BGCOLOR="#COCOCO"><FONT FACE="Arial, Helvetica, Sans-Serif"><FONT SIZE=5><B>Einf&uuml;hrung</B></FONT> </font></TD></TR><TR><TD>&nbsp;</TD></TR><TR><TD><A NAME="referenzmodelle"><H2>Referenzmodelle</H2></A><H3>Das OSI-Referenzmodell</H3><P>Das <I>Open Systems Interconnection (OSI)-Referenzmodell</I> ist ein Modell, da&szlig; auf einem Vorschlag der <I>International Standards Organisation (ISO)</I> basiert. Der Aufbau des OSI-Modells ist in der folgenden Abbildung dargestellt. (Eine ausf&uuml;hrliche Abbildung des OSI-Modells ist hier: <A HREF="kap_1_3_osi.html">[OSI-Referenzmodell]</A>.)<P ALIGN=CENTER><IMG src="http://1.2.3.11/bmi/www.rvs.uni-bielefeld.de/~heiko/tcpip/tcpip_html_alt/abbildungen/osi_model.gif" BORDER=1><BR>Das OSI-Referenzmodell.</P>Das Modell dient derzeit allgemein als Rahmen zur Beschreibung von Protokollcharakteristika und -funktionen <A HREF="referenzen.html#tanenbaum">[Ta96]</A>. Das OSI-Modell (die offizielle Bezeichnung lautet <I>ISO-OSI-Referenzmodell</I>) besteht aus sieben Schichten. Die Schichtung beruht auf dem Prinzip, da&szlig; eine Schicht der jeweils &uuml;ber ihr angeordneten Schicht bestimmte Dienstleistungen anbietet. Das OSI-Modell ist keine Netzarchitektur, da die Protokolle und Dienste der einzelnen Schichten vom Modell nicht definiert werden. Das Modell beschreibt lediglich, welche Aufgaben die Schichten erledigen sollen. Die folgenden Prinzipien haben zur Siebenschichtigkeit des OSI-Modells gef&uuml;hrt <A HREF="referenzen.html#tanenbaum">[Ta96]</A>:<p></P><OL><LI>Eine neue Schicht sollte dort entstehen, wo ein neuer Abstraktionsgrad ben&ouml;tigt wird. <LI>Jede Schicht sollte eine genau definiert Funktion erf&uuml;llen. <LI>Bei der Funktionswahl sollte die Definition international genormter Protokolle ber&uuml;cksichtigt werden. <LI>Die Grenzen zwischen den einzelnen Schichten sollten so gew&auml;hlt werden, da&szlig; der Informationsflu&szlig; &uuml;ber die Schnittstellen m&ouml;glichst gering ist. <LI>Die Anzahl der Schichten sollte so gro&szlig; sein, da&szlig; keine Notwendigkeit besteht, verschiedene Funktionen auf eine Schicht zu packen, aber so klein, da&szlig; die gesamte Architektur nicht unhandlich wird.</OL><P>Den Schichten im OSI-Modell sind die folgenden Aufgaben zugeordnet:</P><P><B>Anwendungsschicht (application layer):</B> Die Anwendungsschicht enth&auml;lt eine gro&szlig;e Zahl h&auml;ufig ben&ouml;tigter Protokolle, die einzelne Programme zur Erbringung ihrer Dienste definiert haben. Auf der Anwendungsschicht finden sich z.B. die Protokolle f&uuml;r die Dienste ftp, telnet, mail etc.</P><P><B>Darstellungsschicht (presentation layer):</B> Die Darstellungsschicht regelt die Darstellung der &Uuml;bertragungsdaten in einer von der dar&uuml;ber liegenden Ebene unabh&auml;ngigen Form. Computersysteme verwenden z.B. oft verschiedene Codierungen f&uuml;r Zeichenketten (z.B. ASCII, Unicode), Zahlen usw. Damit diese Daten zwischen den Systemen ausgetauscht werden k&ouml;nnen, kodiert die Darstellungsschicht die Daten auf eine standardisierte und vereinbarte Weise.</P><P><B>Sitzungsschicht (session layer):</B> Die Sitzungsschicht (oft auch Verbindungsschicht oder Kommunikationssteuerschicht genannt) erm&ouml;glicht den Verbindungsauf- und abbau. Von der Sitzungsschicht wird der Austausch von Nachrichten auf der Transportverbindung geregelt. Sitzungen k&ouml;nnen z.B. erm&ouml;glichen, ob der Transfer gleichzeitig in zwei oder nur eine Richtung erfolgen kann. Kann der Transfer jeweils in nur eine Richtung stattfinden, regelt die Sitzungsschicht, welcher der Kommunikationspartner jeweils an die Reihe kommt.</P><P><B>Transportschicht (transport layer):</B> Die Transportschicht &uuml;bernimmt den Transport von Nachrichten zwischen den Kommunikationspartnern. Die Transportschicht hat die grundlegende Aufgaben, den Datenflu&szlig; zu steuern und die Unverf&auml;lschtheit der Daten sicherzustellen. Beispiele f&uuml;r Transportprotokolle sind TCP und UDP.</P><P><B>Netzwerkschicht (network layer):</B> Die Netzwerkschicht (Vermittlungsschicht) hat die Hauptaufgabe eine Verbindung zwischen Knoten im Netzwerk herzustellen. Die Netzwerkschicht soll dabei die &uuml;bergeordneten Schichten von den Details der Daten&uuml;bertragung &uuml;ber das Netzwerk befreien. Eine der wichtigsten Aufgaben der Netzwerkschicht ist z.B. die Auswahl von Paketrouten bzw. das Routing vom Absender zum Empf&auml;nger. Das Internet Protokoll (IP) ist in der Netzwerkschicht einzuordnen.</P><P><B>Sicherungsschicht (data link layer):</B> Die Aufgabe der Sicherungsschicht (Verbindungsschicht) ist die gesicherte &Uuml;bertragung von Daten. Vom Sender werden hierzu die Daten in Rahmen (frames) aufgeteilt und sequentiell an den Empf&auml;nger gesendet. Vom Empf&auml;nger werden die empfangenen Daten durch Best&auml;tigungsrahmen quittiert. Protokollbeispiele f&uuml;r die Sicherungsschicht sind HDLC (high-level data link control), SLIP (serial line IP) und PPP (point-to-point Protokoll).</P><P><B>Bit&uuml;bertragungsschicht (physical layer):</B> Die Bit&uuml;bertragungsschicht regelt die &Uuml;bertragung von Bits &uuml;ber das &Uuml;bertragungsmedium. Dies betrifft die &Uuml;bertragungsgeschwindigkeit, die Bit-Codierung, den  Anschlu&szlig; (wieviele Pins hat der Netzanschlu&szlig;?) etc. Die Festlegungen auf der Bit&uuml;bertragungsschicht betreffen im wesentlichen die Eigenschaften des &Uuml;bertragungsmedium.</P><A NAME="tcpip"><H3>Das TCP/IP-Referenzmodell</H3></A><P>Im vorhergehenden Abschnitt wurde das OSI-Referenzmodell vorgestellt. In diesem Abschnitt soll nun das Referenzmodell f&uuml;r die TCP/IP-Architektur vorgestellt werden. Das <I>TCP/IP-Referenzmodell</I> - benannt nach den beiden prim&auml;ren Protokollen TCP und IP der Netzarchitektur beruht auf den Vorschl&auml;gen, die bei der Fortentwicklung des ARPANETs gemacht wurden. Das TCP/IP-Modell ist zeitlich vor dem OSI-Referenzmodell entstanden, deshalb sind auch die Erfahrungen des TCP/IP-Modells mit in die OSI-Standardisierung eingeflossen. Das TCP/IP-Referenzmodell besteht im Gegensatz zum OSI-Modell aus nur vier Schichten: Application Layer, Transport Layer, Internet Layer, Network Layer. Als Ziele der Architektur wurden bei der Entwicklung definiert:<ul><li>Unabh&auml;ngigkeit von der verwendeten Netzwerk-Technologie. <li>Unabh&auml;ngigkeit von der Architektur der Hostrechner. <li>Universelle Verbindungsm&ouml;glichkeiten im gesamten Netzwerk. <li>Ende-zu-Ende-Quittungen. <li>Standardisierte Anwendungsprotokolle.</ul><p></P><P ALIGN=CENTER><IMG src="http://1.2.3.13/bmi/www.rvs.uni-bielefeld.de/~heiko/tcpip/tcpip_html_alt/abbildungen/osi-tcpip.gif" BORDER=1><BR>Vergleich des OSI-Referenzmodells mit dem TCP/IP-Referenzmodell.</P><P><B>Applikationsschicht (application layer):</B> Die Applikationsschicht (auch Verarbeitungsschicht genannt) umfa&szlig;t alle h&ouml;herschichtigen Protokolle des TCP/IP-Modells. Zu den ersten Protokollen der Verarbeitungsschicht z&auml;hlen TELNET (f&uuml;r virtuelle Terminals), FTP (Dateitransfer) und SMTP (zur &Uuml;bertragung von E-Mail). Im Laufe der Zeit kamen zu den etablierten Protokollen viele weitere Protokolle wie z.B. DNS (Domain Name Service) und HTTP (Hypertext Transfer Protocol) hinzu.</P><P><B>Transportschicht (transport layer):</B> Wie im OSI-Modell erm&ouml;glicht die Transportschicht die Kommunikation zwischen den Quell- und Zielhosts. Im TCP/IP-Referenzmodell wurden auf dieser Schicht zwei Ende-zu-Ende-Protokolle definiert: das Transmission Control Protocol (TCP) und das User Datagram Protocol (UDP). TCP ist ein zuverl&auml;ssiges verbindungsorientiertes Protokoll, durch das ein Bytestrom fehlerfrei einen anderen Rechner im Internet &uuml;bermittelt werden kann. UDP ist ein unzuverl&auml;ssiges verbindungsloses Protokoll, das vorwiegend f&uuml;r Abfragen und Anwendungen in Client/Server-Umgebungen verwendet wird, in denen es in erster Linie nicht um eine sehr genaue, sondern schnelle Daten&uuml;bermittlung geht (z.B. &Uuml;bertragung von Sprache und Bildsignalen).</P><P><B>Internetschicht (internet layer):</B> Die Internetschicht im TCP/IP-Modell definiert nur ein Protokoll namens IP (Internet Protocol), das alle am Netzwerk beteiligten Rechner verstehen k&ouml;nnen. Die Internetschicht hat die Aufgabe IP-Pakete richtig zuzustellen. Dabei spielt das Routing der Pakete eine wichtige Rolle. Das Internet Control Message Protocol (ICMP) ist fester Bestandteil jeder IP-Implementierung und dient zur &Uuml;bertragung von Diagnose- und Fehlerinformationen f&uuml;r das Internet Protocol.</P><P><B>Netzwerkschicht (network layer):</B> Unterhalb der Internetschicht befindet sich im TCP/IP-Modell eine gro&szlig;e Definitionsl&uuml;cke. Das Referenzmodell sagt auf dieser  Ebene nicht viel dar&uuml;ber aus, was hier passieren soll. Festgelegt ist lediglich, da&szlig; zur &Uuml;bermittlung von IP-Paketen ein Host &uuml;ber ein bestimmtes Protokoll an ein Netz angeschlossen werden mu&szlig;. Dieses Protokoll ist im TCP/IP-Modell nicht weiter definiert und weicht von Netz zu Netz und Host zu Host ab. Das TCP/IP-Modell macht an dieser Stelle vielmehr Gebrauch von bereits vorhandenen Protokollen, wie z.B. Ethernet (IEEE 802.3), Serial Line IP (SLIP), etc.</P></TD></TR><TR><TD>&nbsp;</TD></TR><TR ALIGN="CENTER"><TD><TABLE BORDER=0 CELLSPACING="10" CELLPADDING="2" BGCOLOR="#b1c0dd"><TR><TH WIDTH=25%><P ALIGN=CENTER><A HREF="kap_1_2.html">Zur&uuml;ck</A></TH><TH WIDTH=25%><P ALIGN=CENTER><A HREF="inhalt.html">Inhalt</A></TH><TH WIDTH=25%><P ALIGN=CENTER><A HREF="tcpip.html" target=_top>Home</A></TH><TH WIDTH=25%><P ALIGN=CENTER><A HREF="kap_2_1.html">Weiter</A></TH></TR></TABLE></TD></TR><TR><TD>&nbsp;</TD></TR></TABLE></CENTER><CENTER><TABLE BORDER="0" COLS="2" CELLSPACING="0" CELLPADDING="0" WIDTH="95%"><TR VALIGN="BOTTOM"><TD BGCOLOR="#COCOCO" ALIGN="LEFT"><FONT FACE="Arial, Helvetica, Sans-Serif" SIZE="-1">Heiko Holtkamp, <A HREF="mailto:heiko@rvs.uni-bielefeld.de">heiko@rvs.uni-bielefeld.de</A> </font></TD><TD BGCOLOR="#COCOCO" ALIGN="RIGHT"><FONT FACE="Arial, Helvetica, Sans-Serif" SIZE="-1">letzte &Auml;nderung 2001-06-05</font></TD></TR></TABLE></CENTER></BODY></HTML>